# -*- coding: utf-8 -*-
"""
  Программа к докладу "Программирование простой графики на языке Python",
  учительский день в рамках XI Международной конференции по
  преподаванию информатики в школе, 09.10.2018, Санкт-Петербург
  Автор: К.Ю. Поляков
  E-mail: kpolyakov@mail.ru
  Web: http://kpolyakov.spb.ru

  08_lines.py - линии и полилинии

"""
from graph import *

penColor( "blue" )
line( 20, 20, 100, 40 )

moveTo( 20, 60 )
lineTo( 100, 40 )

polyline( [(20, 100), (20, 80), (100, 80), (100, 100) ] )

brushColor( "red" )
polygon( [(40, 130), (60, 90), (80, 130)] )

run()
